pandolfipedro/pq35-abs-emulator/MK60EC1_emulator/MK60EC1_emulator.ino
//  +------------------+----------+---------+---------------------------------+
//  | MCP2515          |  GPIO    |  Sinal  |  Observacao                     |
//  +------------------+----------+---------+---------------------------------+
//  |  VCC             |  +5V     |  ---    |  modulo tem regulador 3V3 onbd  |
//  |  GND             |  GND     |  ---    |                                 |
//  |  CS              |  GPIO 5  |  SPI_SS |  kConfig.mcpCs                  |
//  |  SCK             |  GPIO 18 |  SPI_CK |  HSPI/VSPI default do ESP32     |
//  |  MOSI / SI       |  GPIO 23 |  SPI_MO |  HSPI/VSPI default do ESP32     |
//  |  MISO / SO       |  GPIO 19 |  SPI_MI |  HSPI/VSPI default do ESP32     |
//  |  INT             |  GPIO 4  |  IRQ    |  kConfig.mcpInt                 |
//  +------------------+----------+---------+---------------------------------+

#include <Arduino.h>
#include <esp_timer.h>
#include <esp_task_wdt.h>
#include <esp_system.h>
#include <esp_idf_version.h>
#include <SPI.h>
#include <cmath>
#include <cstring>
#include <ACAN2515.h>
#include "VehicleStatusLite.h"

// Build variant (lite vs full):
//
//   lite  — CAN only, no Wi-Fi (default below)
//   full  — hidden AP + live status portal + local OTA
//
// Arduino IDE (manual flash):
//   Change the line below to:  #define PQ35_WIFI_PORTAL 1   (full)
//   Or leave as 0 for lite.

#ifndef PQ35_WIFI_PORTAL
#define PQ35_WIFI_PORTAL 0
#endif

#if PQ35_WIFI_PORTAL
#include "WebPortal.h"
#endif

#define FIRMWARE_VERSION "1.2.3"
#if PQ35_WIFI_PORTAL
#define FIRMWARE_VARIANT "full"
#else
#define FIRMWARE_VARIANT "lite"
#endif

static constexpr uint32_t kWdtTimeoutMs = 2000;

struct Config {
   uint8_t mcpCs = 5;
   uint8_t mcpInt = 4;
   uint32_t quartzHz = 8000000UL;
   uint32_t canBitrate = 500000UL;
   float wheelCircumferenceM = 1.985f;
   bool odoDeriveImpulsesPerKm = true;
   float absDistanceImpulsesPerWheelRev = 43.59f;
   float impulsesPerKmCoding = 21960.0f;
   float odoImpulsesPerKmScale = 0.2581f;
   float standstillDeadBandKmh = 2.0f;
   uint32_t obdRequestPeriodMs = 80;
   uint32_t obdTimeoutMs = 1500;
   uint32_t obdHoldMaxMs = 25000;
   float speedTauMs = 180.0f;
   float speedMaxDecayKmhPerS = 12.0f;
   float absCanSlewUpKmhPerS = 220.0f;
   float absCanSlewDownKmhPerS = 65.0f;
   uint16_t obdTransReq = 0x7E1;
   uint16_t obdTransRsp = 0x7E9;
   int32_t maxScheduleSlipUs = 3500;
   bool oemLikeBremse1 = true;
   bool panelSpeedCacheEnable = true;
   float panelCacheRejectBelowKmh = 0.5f;
   bool useMotionCanFusion = true;
   bool motionZeroInPark = true;
   uint32_t motionCanTimeoutMs = 500;
   uint8_t gearWahlPark = 8;
   uint8_t gearWahlReverse = 7;
   uint8_t gearWahlNeutral = 6;
   uint8_t gearWahlDrive = 5;
   bool motionAntiDropEnable = true;
   float motionAntiDropMaxKmhPerS = 90.0f;
   bool emitCompanionEspFrames = true;
   bool emitBremse4HaldexFrame = false;
   // Calibracao do painel: a 100 km/h o cluster mostrava ~95, queremos ~103
   // (overshoot OEM). Fator = 103/95 ~= 1.084. Aplicado SO em Bremse_1/3.
   float speedPanelScaleFactor = 1.084f;
} kConfig;

static inline float effectiveImpulsesPerKm() {
  const float scale = (kConfig.odoImpulsesPerKmScale > 0.00001f) ? kConfig.odoImpulsesPerKmScale : 1.0f;
  if (kConfig.odoDeriveImpulsesPerKm && kConfig.wheelCircumferenceM > 0.001f) {
    return (kConfig.absDistanceImpulsesPerWheelRev * 1000.0f / kConfig.wheelCircumferenceM) * scale;
  }
  return kConfig.impulsesPerKmCoding * scale;
}

static constexpr uint16_t kIdBremse1   = 0x1A0;
static constexpr uint16_t kIdBremse3   = 0x4A0;
static constexpr uint16_t kIdBremse2   = 0x5A0;
static constexpr uint16_t kIdBremse10  = 0x3A0;
static constexpr uint16_t kIdBremse5   = 0x4A8;
static constexpr uint16_t kIdBremse6   = 0x1A8;
static constexpr uint16_t kIdBremse4   = 0x2A0;
static constexpr uint16_t kIdBremse8   = 0x1AC;
static constexpr uint16_t kIdBremse11  = 0x5B7;
static constexpr uint16_t kIdGetriebe1 = 0x440;
static constexpr uint16_t kIdGetriebe2 = 0x540;

 static ACAN2515 gCan(kConfig.mcpCs, SPI, kConfig.mcpInt);

 static bool gMcpOk = false;
 static uint32_t gTxFail1A0 = 0;
 static uint32_t gTxFail4A0 = 0;
 static uint32_t gTxFail5A0 = 0;
 static uint32_t gTxFail3A0 = 0;
 static uint32_t gTxFailEsp = 0;

 static inline uint32_t nowMillis() {
   return (uint32_t)(esp_timer_get_time() / 1000ULL);
 }

 static inline void writeBitsLE(uint8_t *data, unsigned startBit, unsigned bitLen, uint32_t value) {
   for (unsigned i = 0; i < bitLen; ++i) {
     const unsigned bit = startBit + i;
     const unsigned byte = bit / 8u;
     const unsigned mask = 1u << (bit % 8u);
     if (value & (1u << i))
       data[byte] |= mask;
     else
       data[byte] &= uint8_t(~mask);
   }
 }

 static inline uint32_t readBitsLE(const uint8_t *data, unsigned startBit, unsigned bitLen) {
   uint32_t v = 0;
   for (unsigned i = 0; i < bitLen; ++i) {
     const unsigned bit = startBit + i;
     const unsigned byte = bit / 8u;
     if (data[byte] & (1u << (bit % 8u)))
       v |= (1u << i);
   }
   return v;
 }

 static inline uint16_t speedToRaw100(float kmh) {
   if (kmh < 0.0f)
     kmh = 0.0f;

   const float x = kmh * 100.0f;
   if (x > 32766.0f)
     return 32766;
   return uint16_t(x + 0.5f);
 }

 static inline uint16_t midRevsToRaw(float revPerSec) {
   if (revPerSec < 0.0f)
     revPerSec = 0.0f;
   float r = revPerSec / 0.002f;

   if (r < 1.0f)
     r = 1.0f;
   if (r >= 65535.0f)
     return 65535;
   return uint16_t(r + 0.5f);
 }

 static inline float kmhToMidRevs(float kmh) {
   const float v = kmh / 3.6f;
   const float circ = kConfig.wheelCircumferenceM;
   if (circ <= 0.001f)
     return 0.0f;
   return v / circ;
 }

 static inline float effectiveSpeedKmhForOdo(float filteredKmh) {
   const float a = fabsf(filteredKmh);
   if (a < kConfig.standstillDeadBandKmh)
     return 0.0f;
   return filteredKmh;
 }

 static inline float speedForAbsCan(float filteredKmh) {
   if (!isfinite(filteredKmh) || filteredKmh < 0.0f)
     return 0.0f;
   return filteredKmh;
 }

 // Agendador rate-monotonic em microssegundos.
 //
 // Doutrina: a proxima "deadline" e calculada a partir da deadline anterior
 // (nextUs += periodUs), NAO a partir do "agora". Assim, se a iteracao
 // atrasou X us, a proxima espera fica X us mais curta -> a cadencia media
 // do periodo permanece exata, sem drift. Se o atraso passar de
 // kConfig.maxScheduleSlipUs (sistema travou ou houve um burst), reagenda
 // a partir de "agora" para evitar disparar varios ticks atrasados de uma
 // vez (anti burst-catch).
 //
 // poll(usNow): aceita opcionalmente o "agora" da iteracao para reusar
 // uma unica leitura de esp_timer_get_time() em todo o loop principal,
 // garantindo que tarefas concorrentes ancoradas no mesmo instante
 // disparem coerentemente.
 struct PeriodicDeadline {
   int64_t nextUs = 0;
   const int32_t periodUs;

   explicit PeriodicDeadline(int32_t pUs) : periodUs(pUs) {}

   void startNow() { nextUs = esp_timer_get_time() + periodUs; }

   int64_t nextDeadlineUs() const { return nextUs; }

