pandolfipedro/pq35-abs-emulator/MK60EC1_emulator/MK60EC1_emulator.ino
   void syncAfter(const PeriodicDeadline &other, int32_t offsetUs) {
     nextUs = other.nextDeadlineUs() + offsetUs;
   }

   bool poll(int64_t usNow = -1) {
     const int64_t now = (usNow >= 0) ? usNow : esp_timer_get_time();
     if (now < nextUs)
       return false;
     const int64_t slip = now - nextUs;
     if (slip > kConfig.maxScheduleSlipUs) {
       nextUs = now + periodUs;  // anti burst-catch
     } else {
       nextUs += periodUs;       // rate-monotonic puro
     }
     return true;
   }
 };

 // ============================================================
 // SpeedModel: pipeline de filtro IIR + tolerancia a zeros do OBD.
 // Inalterado em relacao a versao funcional 100%.
 // ============================================================
 struct SpeedModel {
   float filteredKmh = 0.0f;
   float heldKmh = 0.0f;
   uint32_t lastGoodMs = 0;
   uint32_t lastAnyObdMs = 0;
   uint32_t lastPositiveKmhMs = 0;
   bool haveEver = false;
   uint8_t zeroRun = 0;

   void onObdSpeed(uint8_t rawKmh, uint32_t nowMs) {
     uint32_t dtMs = nowMs - lastAnyObdMs;
     if (dtMs == 0) dtMs = 1;
     if (dtMs > 1000) dtMs = 1000;
     heldKmh = float(rawKmh);
     lastGoodMs = nowMs;
     lastAnyObdMs = nowMs;
     haveEver = true;
     if (!isfinite(filteredKmh))
       filteredKmh = 0.0f;
     if (rawKmh > 0)
       lastPositiveKmhMs = nowMs;

     if (rawKmh == 0 && filteredKmh > 12.0f && lastPositiveKmhMs != 0 &&
         (nowMs - lastPositiveKmhMs) < 120u) {
       return;
     }
     if (rawKmh == 0)
       zeroRun = (zeroRun < 255) ? uint8_t(zeroRun + 1u) : 255;
     else
       zeroRun = 0;

     const float alpha = (kConfig.speedTauMs <= 1.0f)
                             ? 1.0f
                             : (1.0f - expf(-float(dtMs) / kConfig.speedTauMs));

     const unsigned maxZeroIgnore =
         (filteredKmh > 45.0f) ? 30u : ((filteredKmh > 40.0f) ? 25u : 10u);
     if (rawKmh == 0 && filteredKmh > 3.0f && zeroRun < maxZeroIgnore) {
       return;
     }
     if (rawKmh == 0 && filteredKmh > 3.0f) {
       const float alphaZero = fminf(alpha, 0.25f);
       filteredKmh += (0.0f - filteredKmh) * alphaZero;
       return;
     }
     filteredKmh += (heldKmh - filteredKmh) * alpha;
   }

   void tick(uint32_t nowMs, float dtSec) {
     const uint32_t dtMs = nowMs - lastAnyObdMs;
     if (dtMs > kConfig.obdTimeoutMs) {
       if (haveEver && dtMs < kConfig.obdHoldMaxMs) {
         // hold: mantem filteredKmh
       } else if (haveEver && dtMs >= kConfig.obdHoldMaxMs) {
         const float dec = kConfig.speedMaxDecayKmhPerS * dtSec;
         filteredKmh = fmaxf(0.0f, filteredKmh - dec);
         heldKmh = filteredKmh;
       }
     }
   }

   float displayKmh() const {
     if (!haveEver)
       return 0.0f;
     return filteredKmh;
   }

   bool haveObdEver() const { return haveEver; }
   uint8_t zeroRunCount() const { return zeroRun; }
   float heldRawKmh() const { return heldKmh; }
 };

 static SpeedModel gSpeed;

 // ============================================================
 // VehicleMotionFromCan: agora le APENAS Getriebe1/2 (cambio).
 // Motor1 (0x280, RPM) foi removido a pedido. motionDrivingOem
 // baseia-se SOMENTE em wahlPos / engagedGear.
 // ============================================================
struct VehicleMotionFromCan {
  uint8_t wahlPos = 0xFF;
  uint32_t lastGearMs = 0;
  uint8_t ganganzeige = 0xFF;
  uint8_t engagedGear = 0xFF;
  uint32_t lastGear2Ms = 0;

  void onGetriebe1(const CANMessage &m, uint32_t nowMs) {
    if (m.rtr || m.len < 2)
      return;
    wahlPos = uint8_t(readBitsLE(m.data, 12, 4) & 0x0Fu);
    lastGearMs = nowMs;
  }

  void onGetriebe2(const CANMessage &m, uint32_t nowMs) {
    if (m.rtr || m.len < 8)
      return;
    ganganzeige = uint8_t(readBitsLE(m.data, 56, 4) & 0x0Fu);
    engagedGear = uint8_t(readBitsLE(m.data, 60, 4) & 0x0Fu);
    lastGear2Ms = nowMs;
  }

  bool gearFresh(uint32_t nowMs) const {
    return lastGearMs != 0 && (nowMs - lastGearMs) < kConfig.motionCanTimeoutMs;
  }
  bool gear2Fresh(uint32_t nowMs) const {
    return lastGear2Ms != 0 && (nowMs - lastGear2Ms) < kConfig.motionCanTimeoutMs;
  }
  bool isPark() const { return wahlPos == kConfig.gearWahlPark; }
  bool isDriveOrReverse() const {
    return wahlPos == kConfig.gearWahlDrive || wahlPos == kConfig.gearWahlReverse;
  }
  bool hasEngagedForwardGear() const { return engagedGear >= 1u && engagedGear <= 6u; }

  // Sem RPM, "movimento OEM" passa a ser: marcha em D/R ou marcha
  // engatada (1-6) reportada pelo Getriebe2. Em Park retorna false.
  bool motionDrivingOem(uint32_t nowMs) const {
    if (gearFresh(nowMs) && isPark())
      return false;
    if (gearFresh(nowMs) && isDriveOrReverse())
      return true;
    if (gear2Fresh(nowMs) && hasEngagedForwardGear())
      return true;
    return false;
  }
};

static VehicleMotionFromCan gVehicleMotion;

static float oemAntiDropPanelKmh(float panelIn, float dtSec, uint32_t nowMs) {
  static float sLast = -1.0f;
  if (!kConfig.motionAntiDropEnable || !kConfig.useMotionCanFusion)
    return panelIn;
  if (sLast < 0.0f) {
    sLast = panelIn;
    return panelIn;
  }
  if (!gVehicleMotion.motionDrivingOem(nowMs)) {
    sLast = panelIn;
    return panelIn;
  }
  const float maxStepDown = kConfig.motionAntiDropMaxKmhPerS * dtSec;
  float out = panelIn;
  if (panelIn < sLast - maxStepDown)
    out = sLast - maxStepDown;
  if (panelIn > sLast)
    out = panelIn;
  sLast = out;
  return out;
}

 // ============================================================
 // SpeedPanelCache: janela de 5 amostras com rejeicao de outliers.
 // Inalterado em relacao a versao funcional 100%.
 // ============================================================
 struct SpeedPanelCache {
   static constexpr unsigned kN = 5;
   float window[kN] = {};
   unsigned filled = 0;
   float lastAvg = 0.0f;
   bool haveAvg = false;

   void reset() {
     filled = 0;
     lastAvg = 0.0f;
     haveAvg = false;
   }

   static float windowMax(const float *w, unsigned n) {
     float m = 0.0f;
     for (unsigned i = 0; i < n; ++i)
       if (w[i] > m)
         m = w[i];
     return m;
   }

   void finishWindow(uint32_t nowMs) {
     if (kConfig.useMotionCanFusion && kConfig.motionZeroInPark && gVehicleMotion.gearFresh(nowMs) &&
         gVehicleMotion.isPark()) {
       lastAvg = 0.0f;
       haveAvg = true;
       filled = 0;
       return;
     }

     const float mx = windowMax(window, kN);
     float sum = 0.0f;
     unsigned cnt = 0;
     for (unsigned i = 0; i < kN; ++i) {
       const float x = window[i];
       if (x <= 0.0001f)
         continue;
       if (mx > 3.0f && x < kConfig.panelCacheRejectBelowKmh)
         continue;
       sum += x;
       cnt++;
     }

     if (cnt > 0) {
       lastAvg = sum / float(cnt);
     } else {
       if (kConfig.useMotionCanFusion && gVehicleMotion.motionDrivingOem(nowMs) && mx > 0.0001f &&
           haveAvg) {
         // mantem lastAvg
       } else {
         lastAvg = 0.0f;
       }
     }
     haveAvg = true;
     filled = 0;
   }

   void addSample(float filteredKmh, uint32_t nowMs) {
     if (!kConfig.panelSpeedCacheEnable)
       return;
     if (filled >= kN)
       return;
     window[filled++] = filteredKmh;
     if (filled == kN)
       finishWindow(nowMs);
   }

   float outputForCan(float filteredKmh, uint32_t nowMs) const {
     if (kConfig.useMotionCanFusion && kConfig.motionZeroInPark && gVehicleMotion.gearFresh(nowMs) &&
         gVehicleMotion.isPark())
       return 0.0f;
     if (!kConfig.panelSpeedCacheEnable)
       return filteredKmh;
     if (!haveAvg)
       return filteredKmh;
     return lastAvg;
   }
 };

 static SpeedPanelCache gPanelCache;

