pandolfipedro/pq35-abs-emulator/MK60EC1_emulator/MK60EC1_emulator.ino
 static float slewLimitAbsCan(float targetKmh, float dtSec, bool haveObdEver, uint8_t zeroRun, float heldRawKmh,
                              float kmhFilt) {
   static float sOut = 0.0f;
   const float dt = fmaxf(dtSec, 0.0005f);
   if (!haveObdEver) {
     sOut = 0.0f;
     return 0.0f;
   }
   const float tgt = fmaxf(0.0f, targetKmh);
   const bool stopOk =
       (kmhFilt < 0.6f && zeroRun >= 12u) || (heldRawKmh < 0.5f && zeroRun >= 12u);
   if (stopOk) {
     sOut = tgt;
     return sOut;
   }
   const float up = kConfig.absCanSlewUpKmhPerS * dt;
   const float dn = kConfig.absCanSlewDownKmhPerS * dt;
   if (tgt > sOut)
     sOut = fminf(tgt, sOut + up);
   else
     sOut = fmaxf(tgt, sOut - dn);
   return sOut;
 }

 static inline void splitVehicleImpToWheels(uint32_t v, uint16_t *vl, uint16_t *vr, uint16_t *hl, uint16_t *hr) {
   const uint32_t q = v / 4u;
   const uint32_t r = v % 4u;
   *vl = uint16_t((q + (r > 0u ? 1u : 0u)) & 0x3FFu);
   *vr = uint16_t((q + (r > 1u ? 1u : 0u)) & 0x3FFu);
   *hl = uint16_t((q + (r > 2u ? 1u : 0u)) & 0x3FFu);
   *hr = uint16_t((q + (r > 3u ? 1u : 0u)) & 0x3FFu);
 }

 // ============================================================
 // Odometer: contagem de pulsos. Inalterado.
 // ============================================================
 struct Odometer {
   double impulseFrac = 0.0;
   uint32_t vehImpulses = 0;
   uint32_t vehImpulsesAtLastB2 = 0;

   void reset() {
     impulseFrac = 0.0;
     vehImpulses = 0;
     vehImpulsesAtLastB2 = 0;
   }

   void integrate(float kmh, float dtSec) {
     const double impPerM = (double)effectiveImpulsesPerKm() / 1000.0;
     const double vMs = (double)kmh / 3.6;
     impulseFrac += vMs * dtSec * impPerM;
     if (impulseFrac >= 1.0) {
       const uint32_t add = (uint32_t)floor(impulseFrac);
       vehImpulses += add;
       impulseFrac -= (double)add;
     }
   }

   uint16_t weg11FrontAxle() const { return uint16_t(vehImpulses & 0x7FFu); }

   uint8_t impulszahlForBremse2() {
     const uint32_t d = vehImpulses - vehImpulsesAtLastB2;
     vehImpulsesAtLastB2 = vehImpulses;
     return (d > 63u) ? 63u : uint8_t(d);
   }

   void weg10Wheels(uint16_t *vl, uint16_t *vr, uint16_t *hl, uint16_t *hr) const {
     splitVehicleImpToWheels(vehImpulses, vl, vr, hl, hr);
   }

   uint32_t totalImpulsesForLogging() const { return vehImpulses; }
 };

 static Odometer gOdo;

 static bool extractMode01Pid0d(const CANMessage &m, uint8_t *outKmh) {
   if (m.rtr || m.len < 3)
     return false;
   if (m.len >= 2 && m.data[0] == 0x03u && m.data[1] == 0x7Fu)
     return false;
   for (unsigned i = 0; i + 2u < (unsigned)m.len && i < 7u; ++i) {
     if (m.data[i] == 0x41u && m.data[i + 1] == 0x0Du) {
       *outKmh = m.data[i + 2];
       return true;
     }
   }
   return false;
 }

 // ============================================================
 // ObdClient
 //   - Pergunta SO para a transmissao (0x7E1) e aceita SO 0x7E9.
 //   - Auto-mute em Park: nada na rede CAN com o carro parado, libera
 //     o canal de diagnostico para o VCDS conversar com o cambio.
 // ============================================================
 struct ObdClient {
   uint32_t lastTxMs = 0;

   void setup() { lastTxMs = 0; }

   void trySendRequests(uint32_t nowMs) {
     if (nowMs - lastTxMs < kConfig.obdRequestPeriodMs)
       return;

     // Auto-mute em Park: se o cambio reporta P, nao envia OBD.
     if (kConfig.useMotionCanFusion &&
         gVehicleMotion.gearFresh(nowMs) && gVehicleMotion.isPark())
       return;

     lastTxMs = nowMs;

     CANMessage m;
     memset(&m, 0, sizeof(m));
     m.len = 8;
     m.ext = false;
     m.rtr = false;
     m.data[0] = 0x02;
     m.data[1] = 0x01;
     m.data[2] = 0x0D;
     m.id = kConfig.obdTransReq;
     (void)gCan.tryToSend(m);
   }

   void pollReceive(uint32_t nowMs) {
     CANMessage m;
     while (gCan.receive(m)) {
       const uint16_t id = m.id;
       if (id == kConfig.obdTransRsp) {
         uint8_t v = 0;
         if (extractMode01Pid0d(m, &v))
           gSpeed.onObdSpeed(v, nowMs);
       } else if (id == kIdGetriebe1) {
         gVehicleMotion.onGetriebe1(m, nowMs);
       } else if (id == kIdGetriebe2) {
         gVehicleMotion.onGetriebe2(m, nowMs);
       }
     }
   }
 };

 static ObdClient gObd;

 static uint8_t gBr1Zaehler = 0;
 static uint8_t gB10Zaehler = 0;
 static uint8_t gBr5Zaehler = 0;
 static uint8_t gBr8Zaehler = 0;
 static uint8_t gBr11Zaehler = 0;
 static uint8_t gBr6Zaehler = 0;

 static void buildBremse1(uint8_t *d, float kmh) {
   memset(d, 0, 8);

   if (kmh < 0.0f)
     kmh = 0.0f;
   const float rawF = kmh * 100.0f;
   const uint32_t raw = (rawF > 32767.0f) ? 32767u : uint32_t(rawF + 0.5f);
   writeBitsLE(d, 17, 15, raw);
   if (kConfig.oemLikeBremse1) {
     writeBitsLE(d, 32, 8, 0xFE);
     writeBitsLE(d, 40, 8, 0xFE);
     writeBitsLE(d, 48, 8, 0xFE);
   }
   writeBitsLE(d, 16, 1, 1); // BR1_BKV_active: booster presente
   writeBitsLE(d, 56, 4, gBr1Zaehler & 0x0Fu);
   writeBitsLE(d, 60, 1, 1); // BR1_ASR_ESP: modulo ASR/ESP/MABS (MK60EC1)
   writeBitsLE(d, 63, 1, 0);
 }

 static void buildBremse3(uint8_t *d, float kmh) {
   memset(d, 0, 8);

   if (kmh < 0.0f)
     kmh = 0.0f;
   const uint32_t raw = speedToRaw100(kmh);
   writeBitsLE(d, 0, 1, 0);
   writeBitsLE(d, 1, 15, raw);
   writeBitsLE(d, 16, 1, 0);
   writeBitsLE(d, 17, 15, raw);
   writeBitsLE(d, 32, 1, 0);
   writeBitsLE(d, 33, 15, raw);
   writeBitsLE(d, 48, 1, 0);
   writeBitsLE(d, 49, 15, raw);
 }

 static void buildBremse2(uint8_t *d, float kmh, uint16_t zeitTicks, uint16_t weg11, uint8_t imp6) {
   memset(d, 0, 8);

   writeBitsLE(d, 8, 1, 1);
   d[0] = 250;

   const float mid = kmhToMidRevs(kmh);
   const uint16_t rawMid = uint16_t(midRevsToRaw(mid) & 0x7FFFu);
   writeBitsLE(d, 9, 15, rawMid);

   writeBitsLE(d, 24, 16, zeitTicks);
   writeBitsLE(d, 40, 11, uint32_t(weg11 & 0x7FFu));
   writeBitsLE(d, 56, 6, uint32_t(imp6 & 0x3Fu));
 }

 static void buildBremse10(uint8_t *d, uint16_t weg10VL, uint16_t weg10VR, uint16_t weg10HL, uint16_t weg10HR) {
   memset(d, 0, 8);

   writeBitsLE(d, 8, 4, gB10Zaehler & 0x0Fu);

