pandolfipedro/pq35-abs-emulator/MK60EC1_emulator/MK60EC1_emulator.ino
   writeBitsLE(d, 12, 1, 1);
   writeBitsLE(d, 13, 1, 1);
   writeBitsLE(d, 14, 1, 1);
   writeBitsLE(d, 15, 1, 1);
   writeBitsLE(d, 16, 10, uint32_t(weg10VL & 0x3FFu));
   writeBitsLE(d, 26, 10, uint32_t(weg10VR & 0x3FFu));
   writeBitsLE(d, 36, 10, uint32_t(weg10HL & 0x3FFu));
   writeBitsLE(d, 46, 10, uint32_t(weg10HR & 0x3FFu));

   writeBitsLE(d, 56, 1, 1);
   writeBitsLE(d, 57, 1, 1);
   writeBitsLE(d, 58, 1, 1);
   writeBitsLE(d, 59, 1, 1);
   writeBitsLE(d, 60, 1, 0);
   writeBitsLE(d, 61, 1, 0);
   writeBitsLE(d, 62, 1, 0);
   writeBitsLE(d, 63, 1, 0);

   uint8_t x = 0;
   for (int i = 1; i < 8; ++i)
     x ^= d[i];
   d[0] = x;
 }

 // Builders dos companion frames: APENAS montam o frame. O incremento do
 // Zaehler e feito no caller, somente quando tryToSend() retornar true.
 // Razao: gateway PQ35 detecta "frame perdido" quando ve o counter pular.
 // Se a TX falhar, o frame nao foi pro bus, entao reusar o mesmo counter
 // na proxima tentativa e o comportamento correto.

 // Bremse_5 idle. Se stillstand=true, sinaliza BR5_Stillstand (bit 28) =1
 // -> Autohold/HSA/EPB reconhecem corretamente o estado de parada.
 static void buildBremse5Idle(uint8_t *d, bool stillstand) {
   memset(d, 0, 8);
   writeBitsLE(d, 14, 1, 1); // BR5_Sta_Gierrate: yaw valido
   writeBitsLE(d, 29, 1, 1); // BR5_Druckvalid: pressao valida
   writeBitsLE(d, 30, 1, 1); // BR5_Sta_Druck: status pressao ok
   if (stillstand) writeBitsLE(d, 28, 1, 1);
   writeBitsLE(d, 52, 4, uint32_t(gBr5Zaehler & 0x0Fu));
   uint8_t x = 0;
   for (int i = 0; i < 7; ++i)
     x ^= d[i];
   d[7] = x;
 }

 // Bremse_8 idle. Aceleracoes neutras (0 m/s^2):
 //   BR8_Istbeschl   (bit 32, 9, scale 0.02,    offset -7.22) -> raw 361
 //   BR8_Laengsbeschl(bit 48, 10, scale 0.03125, offset -16)  -> raw 512
 // Sem isso, raw 0 representa -7.22 / -16 m/s^2 (frenagem violenta) e
 // pode confundir o painel/ESP companion.
 static void buildBremse8Idle(uint8_t *d) {
   memset(d, 0, 8);
   writeBitsLE(d, 8, 4, uint32_t(gBr8Zaehler & 0x0Fu));
   writeBitsLE(d, 15, 1, 1);    // BR8_Sta_Br_Druck: status pressao ok
   writeBitsLE(d, 16, 8, 127u); // BR8_TolAbgl_HL: 0% neutro
   writeBitsLE(d, 24, 8, 127u); // BR8_TolAbgl_HR: 0% neutro
   writeBitsLE(d, 32, 9, 361u);
   writeBitsLE(d, 48, 10, 512u);
   uint8_t x = 0;
   for (int i = 1; i < 8; ++i)
     x ^= d[i];
   d[0] = x;
 }

 static void buildBremse6Idle(uint8_t *d) {
   memset(d, 0, 3);
   writeBitsLE(d, 0, 10, 123u);
   writeBitsLE(d, 11, 1, 1); // Status_Bremsdruck: pressao valida
   writeBitsLE(d, 12, 4, uint32_t(gBr6Zaehler & 0x0Fu));
   d[2] = uint8_t(d[0] ^ d[1]);
 }

 static void buildBremse11Idle(uint8_t *d) {
   memset(d, 0, 8);
   writeBitsLE(d, 8, 4, uint32_t(gBr11Zaehler & 0x0Fu));
   writeBitsLE(d, 33, 1, 1); // B11_EPB_Steller_gue: atuador EPB valido
   uint8_t x = 0;
   for (int i = 1; i < 8; ++i)
     x ^= d[i];
   d[0] = x;
 }

 // Bremse_4 idle (Haldex). ABS_Vorgabewert_mitte_Kupplungs (bit 0, 8,
 // scale 3, offset -381): raw 127 = 0 Nm/min (torque neutro). Outros
 // bytes ficam 0. DBC nao define counter pra este frame.
 static void buildBremse4Idle(uint8_t *d) {
   memset(d, 0, 3);
   d[0] = 127;
 }

 static inline bool sendFrame(uint16_t id, const uint8_t *data8) {
   CANMessage m;
   memset(&m, 0, sizeof(m));
   m.id = id;
   m.len = 8;
   m.ext = false;
   m.rtr = false;
   memcpy(m.data, data8, 8);
   return gCan.tryToSend(m);
 }

 static inline bool sendFrameDlc(uint16_t id, const uint8_t *data, uint8_t len) {
   CANMessage m;
   memset(&m, 0, sizeof(m));
   m.id = id;
   m.len = (len > 8u) ? 8u : len;
   m.ext = false;
   m.rtr = false;
   memcpy(m.data, data, m.len);
   return gCan.tryToSend(m);
 }

 static void IRAM_ATTR canISR() { gCan.isr(); }

 static const __FlashStringHelper* resetReasonStr(esp_reset_reason_t r) {
   switch (r) {
     case ESP_RST_POWERON:  return F("POWERON");
     case ESP_RST_EXT:      return F("EXT");
     case ESP_RST_SW:       return F("SW");
     case ESP_RST_PANIC:    return F("PANIC");
     case ESP_RST_INT_WDT:  return F("INT_WDT");
     case ESP_RST_TASK_WDT: return F("TASK_WDT");
     case ESP_RST_WDT:      return F("WDT");
     case ESP_RST_DEEPSLEEP:return F("DEEPSLEEP");
     case ESP_RST_BROWNOUT: return F("BROWNOUT");
     case ESP_RST_SDIO:     return F("SDIO");
     default:               return F("UNKNOWN");
   }
 }

 void setup() {
   Serial.begin(115200);
   delay(200);
   Serial.print(F("MK60 PQ35 ABS "));
   Serial.print(FIRMWARE_VERSION);
   Serial.print(F("-"));
   Serial.println(FIRMWARE_VARIANT);
   Serial.println(F("cambio-only OBD | RX 440/540 | INT GPIO 4"));
   Serial.print(F("Reset reason: "));
   Serial.println(resetReasonStr(esp_reset_reason()));

   SPI.begin(18, 19, 23);

   ACAN2515Settings settings(kConfig.quartzHz, kConfig.canBitrate);
   settings.mRequestedMode = ACAN2515Settings::NormalMode;

   const ACAN2515Mask rxm = standard2515Mask(0x7FF, 0x00, 0x00);
   const ACAN2515AcceptanceFilter filters[] = {
       {standard2515Filter(kConfig.obdTransRsp, 0x00, 0x00), nullptr},
       {standard2515Filter(kIdGetriebe1, 0x00, 0x00), nullptr},
       {standard2515Filter(kIdGetriebe2, 0x00, 0x00), nullptr},
   };

   uint16_t err = 0;
   for (int attempt = 1; attempt <= 5; ++attempt) {
     err = gCan.begin(settings, canISR, rxm, rxm,
                      filters, uint8_t(sizeof(filters) / sizeof(filters[0])));
     if (err == 0) break;
     Serial.print(F("ACAN2515 begin tentativa "));
     Serial.print(attempt);
     Serial.print(F(" falhou: 0x"));
     Serial.println(err, HEX);
     delay(500);
   }
   if (err != 0) {
     Serial.println(F("[FATAL] MCP2515 did not initialize. Restarting..."));
     Serial.flush();
     delay(200);
     esp_restart();
   }
   Serial.println(F("MCP2515 OK @ 500k"));
   gMcpOk = true;

   gObd.setup();
   vehicleStatusBegin();

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
   {
     const esp_task_wdt_config_t wdt_cfg = {
       .timeout_ms     = kWdtTimeoutMs,
       .idle_core_mask = 0,
       .trigger_panic  = true,
     };
     esp_task_wdt_reconfigure(&wdt_cfg);
   }
#else
   esp_task_wdt_init(kWdtTimeoutMs / 1000u, true);
#endif
   esp_task_wdt_add(NULL);

#if PQ35_WIFI_PORTAL
   webPortalBegin(FIRMWARE_VERSION, FIRMWARE_VARIANT);
#else
   Serial.println(F("Wi-Fi disabled (lite build)"));
#endif
 }

 void loop() {
   // Relogio de microssegundos capturado UMA UNICA VEZ por iteracao.
   // Todos os subsistemas que precisam de "agora" derivam deste valor:
   //   - ms   = usNow / 1000    (modulos legados que esperam millis)
   //   - dtUs = usNow - last    (precisao sub-ms para o IIR)
   //   - PeriodicDeadline::poll(usNow) reusa este relogio.
   // Assim, todas as decisoes da iteracao sao coerentes com o mesmo
   // instante e nao ha drift entre tarefas.
   const int64_t usNow = esp_timer_get_time();
   const uint32_t ms   = (uint32_t)(usNow / 1000LL);

   // Telemetria de jitter: dt entre inicios de loop (em us, 64 bits para
   // nao haver wrap). Se passar de 12 ms, conta um "slow loop".
   static int64_t lastLoopUs = 0;
   static uint32_t loopDtMaxUsThisSec = 0;
   static uint32_t slowLoopOver12ms = 0;
   if (lastLoopUs != 0) {
     const int64_t dtUs64 = usNow - lastLoopUs;
     const uint32_t dtUs = (dtUs64 > 0 && dtUs64 < 0x7FFFFFFFLL) ? (uint32_t)dtUs64 : 0u;
     if (dtUs > loopDtMaxUsThisSec)
       loopDtMaxUsThisSec = dtUs;
     if (dtUs > 12000u)
       slowLoopOver12ms++;
   }

   // dtSec calculado em US para precisao sub-ms no filtro IIR de
   // velocidade. Antes era em ms inteiros, perdendo ate 999us de
   // resolucao por iteracao -> agora cada loop cycle conta exato.
   const int64_t dtUsForFilter = (lastLoopUs == 0) ? 1000LL : (usNow - lastLoopUs);
   lastLoopUs = usNow;
   const float dtSec = fmaxf((float)dtUsForFilter / 1.0e6f, 0.0005f);

