pandolfipedro/pq35-abs-emulator/MK60EC1_emulator/MK60EC1_emulator.ino
   gObd.pollReceive(ms);
   gObd.trySendRequests(ms);
   gSpeed.tick(ms, dtSec);

   const float kmhFilt = gSpeed.displayKmh();

   static PeriodicDeadline t10(10000);
   static PeriodicDeadline t20(20000);
   static bool tInit = false;
   if (!tInit) {
     t10.startNow();
     t20.syncAfter(t10, 10000);
     tInit = true;
   }

   const bool tick10ms = t10.poll(usNow);
   if (tick10ms)
     gPanelCache.addSample(kmhFilt, ms);

   const float kmhPanelRaw = gPanelCache.outputForCan(kmhFilt, ms);
   const float kmhPanel    = oemAntiDropPanelKmh(kmhPanelRaw, dtSec, ms);
   const float kmhCan      = speedForAbsCan(kmhPanel);
   const float kmhAbsTx    = slewLimitAbsCan(kmhCan, dtSec, gSpeed.haveObdEver(),
                                             gSpeed.zeroRunCount(),
                                             gSpeed.heldRawKmh(), kmhPanel);

   // Velocidade ESCALADA (somente para frames lidos pelo painel/cluster).
   // Nao afeta o odometro: gOdo.integrate usa kmhAbsTx puro -> 100 km no
   // GPS = 100 km no hodometro, independente do fator do painel.
   const float kmhPanelTx = fmaxf(0.0f, kmhAbsTx * kConfig.speedPanelScaleFactor);

   const float kmhOdo = effectiveSpeedKmhForOdo(kmhAbsTx);

   const float dtOdo = fminf(dtSec, 0.08f);
   gOdo.integrate(kmhOdo, dtOdo);
   gObd.pollReceive(ms);

   static uint16_t sZeit = 0;

   uint8_t b1[8], b3[8], b2[8], b10[8];

   if (tick10ms) {
     sZeit = uint16_t(sZeit + 10);
     // Bremse_1 e Bremse_3 vao ESCALADOS: o painel mostrara ~103 quando
     // o GPS estiver em 100 (overshoot OEM). Bremse_2 (mid-rev, ABS
     // interno) usa kmhAbsTx puro.
     buildBremse1(b1, kmhPanelTx);
     buildBremse3(b3, kmhPanelTx);
     // Zaehler so incrementa se o frame foi efetivamente enfileirado
     // para TX. Se falhar, mesmo counter sera reusado no proximo ciclo.
     if (sendFrame(kIdBremse1, b1))
       gBr1Zaehler = uint8_t((gBr1Zaehler + 1u) & 0x0Fu);
     else
       gTxFail1A0++;
     if (!sendFrame(kIdBremse3, b3))  // Bremse_3 nao tem counter no DBC
       gTxFail4A0++;
   }

   if (t20.poll(usNow)) {
     uint16_t wvl, wvr, whl, whr;
     gOdo.weg10Wheels(&wvl, &wvr, &whl, &whr);
     buildBremse2(b2, kmhAbsTx, sZeit, gOdo.weg11FrontAxle(), gOdo.impulszahlForBremse2());
     buildBremse10(b10, wvl, wvr, whl, whr);
     if (!sendFrame(kIdBremse2, b2))  // Bremse_2 nao tem counter
       gTxFail5A0++;
     if (sendFrame(kIdBremse10, b10))
       gB10Zaehler = uint8_t((gB10Zaehler + 1u) & 0x0Fu);
     else
       gTxFail3A0++;

     if (kConfig.emitCompanionEspFrames) {
       uint8_t b5[8], b8[8], b6[3], b11[8];
       const bool stillstand = (kmhAbsTx < 1.0f);
       buildBremse5Idle(b5, stillstand);
       buildBremse8Idle(b8);
       buildBremse6Idle(b6);
       buildBremse11Idle(b11);
       if (sendFrame(kIdBremse5, b5))
         gBr5Zaehler = uint8_t((gBr5Zaehler + 1u) & 0x0Fu);
       else
         gTxFailEsp++;
       if (sendFrame(kIdBremse8, b8))
         gBr8Zaehler = uint8_t((gBr8Zaehler + 1u) & 0x0Fu);
       else
         gTxFailEsp++;
       if (sendFrameDlc(kIdBremse6, b6, 3))
         gBr6Zaehler = uint8_t((gBr6Zaehler + 1u) & 0x0Fu);
       else
         gTxFailEsp++;
       if (sendFrame(kIdBremse11, b11))
         gBr11Zaehler = uint8_t((gBr11Zaehler + 1u) & 0x0Fu);
       else
         gTxFailEsp++;
       if (kConfig.emitBremse4HaldexFrame) {
         uint8_t b4[3];
         buildBremse4Idle(b4);
         if (!sendFrameDlc(kIdBremse4, b4, 3))  // Bremse_4 nao tem counter
           gTxFailEsp++;
       }
     }
   }

   {
     VehicleStatusLite vs;
     vs.updatedMs = ms;
     vs.speedFiltKmh = kmhFilt;
     vs.speedPanelKmh = kmhPanelTx;
     vs.speedCanTxKmh = kmhAbsTx;
     vs.speedOdoKmh = kmhOdo;
     vs.obdValid = gSpeed.haveObdEver();
     vs.gearWahl = gVehicleMotion.wahlPos;
     vs.gearEngaged = gVehicleMotion.engagedGear;
     vs.gearValid = gVehicleMotion.gearFresh(ms);
     vs.inPark = gVehicleMotion.gearFresh(ms) && gVehicleMotion.isPark();
     vs.motionDriving = gVehicleMotion.motionDrivingOem(ms);
     vs.odoImpulses = gOdo.totalImpulsesForLogging();
     vs.impPerKm = effectiveImpulsesPerKm();
     vs.rxBuf = (uint8_t)gCan.receiveBufferCount();
     vs.txFail1A0 = gTxFail1A0;
     vs.txFail4A0 = gTxFail4A0;
     vs.txFail5A0 = gTxFail5A0;
     vs.txFail3A0 = gTxFail3A0;
     vs.txFailEsp = gTxFailEsp;
     vs.mcpOk = gMcpOk;
     vehicleStatusPublish(vs);
   }

   esp_task_wdt_reset();

   // Log 1Hz baseado em us (int64_t -> sem wrap). Robusto e coerente com
   // o relogio capturado no inicio do loop.
   static int64_t lastLogUs = 0;
   if (usNow - lastLogUs > 1000000LL) {
     lastLogUs = usNow;

     const uint32_t heapFree = esp_get_free_heap_size();
     const uint32_t heapMin  = esp_get_minimum_free_heap_size();
     const uint32_t stackWM  = uxTaskGetStackHighWaterMark(NULL);

     Serial.print(F("loop dt max(ms)/>12ms: "));
     Serial.print(loopDtMaxUsThisSec / 1000.0f, 2);
     Serial.print('/');
     Serial.print(slowLoopOver12ms);
     Serial.print(F(" | "));
     loopDtMaxUsThisSec = 0;
     slowLoopOver12ms = 0;
     Serial.print(F("km/h filt/panel0/panel/CANtx/panelTx/odo: "));
     Serial.print(kmhFilt, 1);
     Serial.print('/');
     Serial.print(kmhPanelRaw, 1);
     Serial.print('/');
     Serial.print(kmhPanel, 1);
     Serial.print('/');
     Serial.print(kmhAbsTx, 1);
     Serial.print('/');
     Serial.print(kmhPanelTx, 1);
     Serial.print('/');
     Serial.print(kmhOdo, 1);
     Serial.print(F(" | impulsos: "));
     Serial.print(gOdo.totalImpulsesForLogging());
     Serial.print(F(" | imp/km: "));
     Serial.print(effectiveImpulsesPerKm(), 1);
     Serial.print(F(" | RX buf: "));
     Serial.println(gCan.receiveBufferCount());
     Serial.print(F("Cambio wahl/eg: "));
     Serial.print(gVehicleMotion.wahlPos, DEC);
     Serial.print('/');
     Serial.print(gVehicleMotion.engagedGear, DEC);
     Serial.print(F(" | heap free/min: "));
     Serial.print(heapFree);
     Serial.print('/');
     Serial.print(heapMin);
     Serial.print(F(" | stack: "));
     Serial.print(stackWM);
     Serial.print(F(" | TX fail 1A0/4A0/5A0/3A0/esp: "));
     Serial.print(gTxFail1A0);
     Serial.print('/');
     Serial.print(gTxFail4A0);
     Serial.print('/');
     Serial.print(gTxFail5A0);
     Serial.print('/');
     Serial.print(gTxFail3A0);
     Serial.print('/');
     Serial.println(gTxFailEsp);

     if (stackWM < 512u)
       Serial.println(F("[WARN] Stack baixa!"));
   }
 }
